; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city6)
	(= (capacity plane1) 10810)
	(= (fuel plane1) 467)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 12)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city5)
	(= (capacity plane2) 5171)
	(= (fuel plane2) 188)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 4)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city1)
	(= (capacity plane3) 14337)
	(= (fuel plane3) 799)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 5)
	(at person1 city5)
	(at person2 city3)
	(at person3 city6)
	(at person4 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 816)
	(= (distance city0 city2) 670)
	(= (distance city0 city3) 952)
	(= (distance city0 city4) 565)
	(= (distance city0 city5) 804)
	(= (distance city0 city6) 667)
	(= (distance city1 city0) 816)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 577)
	(= (distance city1 city3) 897)
	(= (distance city1 city4) 964)
	(= (distance city1 city5) 778)
	(= (distance city1 city6) 537)
	(= (distance city2 city0) 670)
	(= (distance city2 city1) 577)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 526)
	(= (distance city2 city4) 581)
	(= (distance city2 city5) 557)
	(= (distance city2 city6) 914)
	(= (distance city3 city0) 952)
	(= (distance city3 city1) 897)
	(= (distance city3 city2) 526)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 955)
	(= (distance city3 city5) 896)
	(= (distance city3 city6) 931)
	(= (distance city4 city0) 565)
	(= (distance city4 city1) 964)
	(= (distance city4 city2) 581)
	(= (distance city4 city3) 955)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 718)
	(= (distance city4 city6) 511)
	(= (distance city5 city0) 804)
	(= (distance city5 city1) 778)
	(= (distance city5 city2) 557)
	(= (distance city5 city3) 896)
	(= (distance city5 city4) 718)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 676)
	(= (distance city6 city0) 667)
	(= (distance city6 city1) 537)
	(= (distance city6 city2) 914)
	(= (distance city6 city3) 931)
	(= (distance city6 city4) 511)
	(= (distance city6 city5) 676)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city5)
	(at person2 city1)
	(at person3 city0)
	(at person4 city5)
	))

(:metric minimize (+ (* 5 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane1 city6)
   changed: (fuel plane1) from 467 to 10810
   goals met: 1 of 4
2. (board person3 plane1 city6)
   deleted: (at person3 city6)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 4
3. (fly plane1 city6 city0)
   deleted: (at plane1 city6)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 2668, (fuel plane1) from 10810 to 8142
   goals met: 1 of 4
4. (debark person3 plane1 city0)
   deleted: (in person3 plane1)
   added: (at person3 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 4
5. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 2668 to 6476, (fuel plane1) from 8142 to 4334
   goals met: 2 of 4
6. (board person2 plane1 city3)
   deleted: (at person2 city3)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 4
7. (fly plane1 city3 city1)
   deleted: (at plane1 city3)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 6476 to 10064, (fuel plane1) from 4334 to 746
   goals met: 2 of 4
8. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (at person2 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 4
9. (refuel plane1 city1)
   changed: (fuel plane1) from 746 to 10810
   goals met: 3 of 4
10. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 10064 to 13920, (fuel plane1) from 10810 to 6954
   goals met: 3 of 4
11. (board person4 plane1 city4)
   deleted: (at person4 city4)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 4
12. (fly plane1 city4 city5)
   deleted: (at plane1 city4)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 13920 to 16792, (fuel plane1) from 6954 to 4082
   goals met: 3 of 4
13. (debark person4 plane1 city5)
   deleted: (in person4 plane1)
   added: (at person4 city5)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 4
